       01 REG-USUARIOS.
            03 ID-USUARIO             PIC 99.
            03 NM-USUARIO             PIC X(100).
            03 TEL-USUARIO.
               05 WS-DDD              PIC X(02).
               05 WS-PREFIXO          PIC X(04).
               05 WS-SUFIXO           PIC X(04).
            03 EMAIL-USUARIO          PIC X(100).
            03 PASSWORD-USUARIO       PIC X(100).
